avr-rust/avrd/packs/tiny/ATtiny102.atdf
        <register caption="Timer/Counter0 " name="TCNT0" offset="0x28" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter 0 Output Compare Register A " name="OCR0A" offset="0x26" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter0 Output Compare Register B " name="OCR0B" offset="0x24" size="2" mask="0xFFFF"/>
        <register caption="Input Capture Register  Bytes" name="ICR0" offset="0x22" size="2" mask="0xFFFF"/>
        <register caption="Timer Interrupt Mask Register 0" name="TIMSK0" offset="0x2B" size="1">
          <bitfield caption="Input Capture Interrupt Enable" mask="0x20" name="ICIE0"/>
          <bitfield caption="Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Overflow Interrupt Enable" name="TIFR0" offset="0x2A" size="1">
          <bitfield caption="Input Capture Flag" mask="0x20" name="ICF0"/>
          <bitfield caption="Timer Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Timer Output Compare Flag 0A" mask="0x02" name="OCF0A"/>
          <bitfield caption="Timer Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x2F" size="1">
          <bitfield caption="Timer Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Remap Bit for 14 pin part only" mask="0x02" name="REMAP"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSR"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART">
        <register caption="USART I/O Data Register" name="UDR" offset="0x08" bit-addressable="false" size="1" mask="0xFF"/>
        <register caption="USART Control and Status Register A" name="UCSRA" offset="0x0E" bit-addressable="false" size="1">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSRB" offset="0x0D" bit-addressable="false" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSRC" offset="0x0C" bit-addressable="false" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
        </register>
        <register caption="USART Control and Status Register D" name="UCSRD" offset="0x0B" bit-addressable="false" size="1">
          <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE"/>
          <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS"/>
          <bitfield caption="Start frame detection enable" mask="0x20" name="SFDE"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR" offset="0x09" bit-addressable="false" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group caption="" name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
